
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий      

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СформироватьДвижения(); 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()  
                                   
	Для Каждого Строка Из Выплаты Цикл
		ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Расход;   
		ДвижениеВзаиморасчеты.Сотрудник = Строка.Сотрудник;
		ДвижениеВзаиморасчеты.Сумма = Строка.Сумма;
		ДвижениеВзаиморасчеты.Период = Дата;
	КонецЦикла;

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

КонецПроцедуры 

#КонецОбласти

#КонецЕсли
