#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//Отчет "Расход запланированных отпусков"
	//Технические требования: отчёты должны формироваться по данным регистров,недопустимо обращаться к данным документов,
	
	Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина; 
	Для Каждого  Строка из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить();
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.НачалоОтпуска = Строка.ДатаНачала;
		Движение.ОкончаниеОтпуска = Строка.ДатаОкончания; 
		РазницаВДнях = (НачалоДня(Движение.ОкончаниеОтпуска) - НачалоДня(Движение.НачалоОтпуска)) / (60 * 60 * 24)+1;
		Движение.ДнейОтпускаПлан =  РазницаВДнях;
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
