#Область СлужебныеПроцедурыИФункции

Функция ОтравитьСообщениеВГруппуТелеграмм (ИмяСобытия)
	
	Результат = Истина; 
	
	Tgm_token = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	//8098109101:AAEduEJDywKj_t6nr2Xf0HxWDE9wbBeKXXM
	
	Chat_id = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	//-1002255976240
	
	//Ресурс = СтрШаблон("bot%1/getUpdates", tgm_token);
	Ресурс = СтрШаблон("bot%1/sendMessage?chat_id=%2&text=%3", Tgm_token,Chat_id,ИмяСобытия);
	Host = "api.telegram.org";
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL();
	HTTPСоединение = Новый HTTPСоединение(Host,,,,,,SSL);
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос); 
	Если HTTPОтвет.КодСостояния <> 200 тогда 
		//Сообщить("ERROR: Ошибка отправки!");
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ("ERROR: Ошибка отправки");
		Сообщение.Сообщить();

		Результат = Ложь; 
	КонецЕсли;
	//Сообщить("OK: сообщение успешно отправлено.");
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ("OK: сообщение успешно отправлено.");
	Сообщение.Сообщить();
	
	Возврат Результат;
КонецФункции

Процедура ОтравитьВсеСообщенияВГруппуТелеграмм () Экспорт 
	
	Результат = Справочники.ВКМ_УведомленияТелеграмБоту.Выбрать();

	Пока Результат.Следующий() Цикл
		ОбъектСправочника = Результат.ПолучитьОбъект(); 
		ИмяСобытия = ОбъектСправочника.ТекстСообщения; 
		РезультатОтпраки = ОтравитьСообщениеВГруппуТелеграмм (ИмяСобытия);
		Если РезультатОтпраки Тогда
			ОбъектСправочника.Удалить();	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти