#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры   

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
    Объект.Начисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Ссылка КАК Сотрудник,
	               |	Пользователи.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.Служебный <> ИСТИНА";    
	
	 ВыборкаСотрудники = Запрос.Выполнить().Выбрать();
	 //ВыборкаСотрудникиТЗ = Запрос.Выполнить().Выгрузить();

	 Пока ВыборкаСотрудники.Следующий() Цикл
	 	СтрокаНачислений = Объект.Начисления.Добавить();
		СтрокаНачислений.Сотрудник = ВыборкаСотрудники.Сотрудник;  
		СтрокаНачислений.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад; 
		СтрокаНачислений.ДатаНачала = НачалоМесяца(Объект.Дата);
		СтрокаНачислений.ДатаОкончания = КонецМесяца(Объект.Дата);
	КонецЦикла;   
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ГруппыДоступаПользователи.Пользователь КАК Специалист,
	//               |	ГруппыДоступаПользователи.Пользователь.Наименование КАК Наименование
	//               |ИЗ
	//               |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	//               |		ПО ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступаРоли.Ссылка
	//               |ГДЕ
	//               |	ПрофилиГруппДоступаРоли.Роль.Имя В(&Роль1)"
	//               ;
	//			   
	//Запрос.УстановитьПараметр("Роль1", "ВКМ_СТО_Специалист"); 
	//УстановитьПривилегированныйРежим(Истина);
	//ВыборкаСпециалисты = Запрос.Выполнить().Выбрать();
	//ВыборкаСпециалистыТЗ = Запрос.Выполнить().Выгрузить();
	//УстановитьПривилегированныйРежим(Ложь);
	//
	//
	// Пока ВыборкаСпециалисты.Следующий() Цикл
	// 	СтрокаНачислений = Объект.Начисления.Добавить();
	//	СтрокаНачислений.Сотрудник = ВыборкаСпециалисты.Специалист;  
	//	СтрокаНачислений.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияСВыработки; 
	//	СтрокаНачислений.ДатаНачала = НачалоМесяца(Объект.Дата);
	//	СтрокаНачислений.ДатаОкончания = КонецМесяца(Объект.Дата);
	//КонецЦикла;   
	
КонецПроцедуры   

#КонецОбласти

