#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресТабличнойЧасти = Параметры.ТабличнаяЧастьВХ;
	Объект.ОтпускаСотрудников.Загрузить(ПолучитьИзВременногоХранилища(АдресТабличнойЧасти)); 
	//ЗаполнитьНаСервере(ДиГа);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере(ДиГа);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере(ДиГа)
	ДиГа.Обновление = Ложь;
	ДиГа.Очистить();  
	ЗаполнитьДанные(ДиГа);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанные(ДиГа)
	Серия = ДиГа.УстановитьСерию("Отпуск");
	
	Для Каждого Строка из Объект.ОтпускаСотрудников Цикл 
		Точка = ДиГа.УстановитьТочку(Строка.Сотрудник);
		Значение = ДиГа.ПолучитьЗначение(Точка,Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;

	КонецЦикла;
КонецПроцедуры  

#КонецОбласти



