#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СформироватьДвижения(); 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
  
	Для Каждого Строка Из СписокСотрудников Цикл
		
		ДвижениеФиксированнаяПремия = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ДвижениеФиксированнаяПремия.ПериодРегистрации = Дата;
		ДвижениеФиксированнаяПремия.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		ДвижениеФиксированнаяПремия.БазовыйПериодНачало = Дата;    
		ДвижениеФиксированнаяПремия.БазовыйПериодКонец = Дата;  		
		ДвижениеФиксированнаяПремия.Сотрудник = Строка.Сотрудник;   
		ДвижениеФиксированнаяПремия.Результат = Строка.СуммаПремии;
		
		ДвижениеНДФЛ = Движения.ВКМ_Удержания.Добавить();
		ДвижениеНДФЛ.ПериодРегистрации = ДвижениеФиксированнаяПремия.ПериодРегистрации;
		ДвижениеНДФЛ.БазовыйПериодНачало = Дата;    
		ДвижениеНДФЛ.БазовыйПериодКонец = Дата;  		
		ДвижениеНДФЛ.Результат = Окр(Строка.СуммаПремии * 13/100,2);	
		ДвижениеНДФЛ.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ДвижениеНДФЛ.Сотрудник = Строка.Сотрудник;

		//ДвижениеНДФЛ.БазаВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия.Ссылка;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВКМ_ДополнительныеНачисления.Наименование КАК ФиксированнаяПремияНаименование,
		               |	ВКМ_ДополнительныеНачисления.Ссылка КАК ФиксированнаяПремияСсылка
		               |ИЗ
		               |	ПланВидовРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		               |ГДЕ
		               |	ВКМ_ДополнительныеНачисления.Наименование = ""Фиксированная премия"""; 
		Выборка =  Запрос.Выполнить().Выбрать();
		//ВыборкаТЗ =  Запрос.Выполнить().Выгрузить();

		
		Пока Выборка.Следующий() Цикл
			ДвижениеНДФЛ.БазаВидРасчета=Выборка.ФиксированнаяПремияСсылка;
		КонецЦикла;
		
		ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;   
		ДвижениеВзаиморасчеты.Сотрудник = Строка.Сотрудник;
		ДвижениеВзаиморасчеты.Сумма = ДвижениеФиксированнаяПремия.Результат - ДвижениеНДФЛ.Результат;
		ДвижениеВзаиморасчеты.Период = Дата;
		//Движение.Регистратор = Ссылка;

	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();  
	
	Движения.ВКМ_Удержания.Записать();

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

КонецПроцедуры 

#КонецОбласти

#КонецЕсли

