#Область СлужебныеПроцедурыИФункции

Функция ПроверкаАктовДлитльнаяОперация(Период, УникальныйИдентификатор) экспорт   
//Функция ПроверкаАктовДлитльнаяОперация(Параметр, Период) экспорт

	
	Период.ДатаНачала = НачалоМесяца(Период.ДатаНачала);
	Период.ДатаОкончания = КонецМесяца(Период.ДатаОкончания); 
	
	Если Месяц(Период.ДатаНачала) <> Месяц(Период.ДатаОкончания) Тогда
		 Период.ДатаОкончания = КонецМесяца(Период.ДатаНачала);
		 НовоеСообщение = Новый СообщениеПользователю;
		 НовоеСообщение.Поле = "Период"; 
		 НовоеСообщение.Текст = "В поле периода нужно выбирать период - МЕЯЦ";
		 НовоеСообщение.Сообщить();
	КонецЕсли; 

	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ДоговорыКонтрагентов.Ссылка КАК Договор,
	             |	ДоговорыКонтрагентов.Организация КАК Организация,
	             |	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	             |	ДоговорыКонтрагентов.ВКМ_ПериодДействияДоговораНачало КАК ВКМ_ПериодДействияДоговораНачало,
	             |	ДоговорыКонтрагентов.ВКМ_ПериодДействияДоговораОкончание КАК ВКМ_ПериодДействияДоговораОкончание
	             |ПОМЕСТИТЬ ВТ_СправочникДоговоры
	             |ИЗ
	             |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	             |ГДЕ
	             |	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	             |	И НАЧАЛОПЕРИОДА(ДоговорыКонтрагентов.ВКМ_ПериодДействияДоговораНачало, МЕСЯЦ) <= &ДатаНачало
	             |	И КОНЕЦПЕРИОДА(ДоговорыКонтрагентов.ВКМ_ПериодДействияДоговораОкончание, МЕСЯЦ) >= &ДатаКонец
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	РеализацияТоваровУслуг.Ссылка КАК Документ,
	             |	РеализацияТоваровУслуг.Организация КАК Организация,
	             |	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	             |	РеализацияТоваровУслуг.Договор КАК Договор,
	             |	РеализацияТоваровУслуг.Дата КАК Дата
	             |ПОМЕСТИТЬ ВТ_ДанныеДокументов
	             |ИЗ
	             |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	             |ГДЕ
	             |	РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
	             |	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачало И &ДатаКонец
	             |	И РеализацияТоваровУслуг.Проведен = ИСТИНА
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ_СправочникДоговоры.Договор КАК Договор,
	             |	ВТ_СправочникДоговоры.Организация КАК Организация,
	             |	ВТ_СправочникДоговоры.Контрагент КАК Контрагент,
	             |	ВТ_ДанныеДокументов.Документ КАК ДокументСсылка
	             |ИЗ
	             |	ВТ_СправочникДоговоры КАК ВТ_СправочникДоговоры
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеДокументов КАК ВТ_ДанныеДокументов
	             |		ПО ВТ_СправочникДоговоры.Организация = ВТ_ДанныеДокументов.Организация
	             |			И ВТ_СправочникДоговоры.Контрагент = ВТ_ДанныеДокументов.Контрагент
	             |			И ВТ_СправочникДоговоры.Договор = ВТ_ДанныеДокументов.Договор";
  
	Запрос.УстановитьПараметр("ДатаНачало",Период.ДатаНачала); 
	Запрос.УстановитьПараметр("ДатаКонец",Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.АбоненскоеОбслуживание);
	Выборка = Запрос.Выполнить().Выбрать();
	ВыборкаТЗ =  Запрос.Выполнить().Выгрузить();
	
	
	//СписокАктов.Загрузить(ВыборкаТЗ); 
	
	//{Заглушка для имитации длительной операции
	Пауза = ТекущаяДатаСеанса()+ 5;//задержка на 5 сек
	пока ТекущаяДатаСеанса()<= Пауза цикл
	КонецЦикла;
	//}
	
	//Возврат Параметр;//просто будем сообщать
	АдресВХ = ПоместитьВоВременноеХранилище(ВыборкаТЗ,УникальныйИдентификатор); 
	//ТЗ_ = ПолучитьИзВременногоХранилища(АдресВХ);
	Возврат АдресВХ;
КонецФункции  

#КонецОбласти