#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	//{{ВКМ_			
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	  	
	//{{ВКМ_ Отображение реквизитов абонентского договора
	ПоказатьРеквизитыАбонентскогоДоговора();
	//}}
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	//{{ВКМ_ Отображение реквизитов абонентского договора  
	ПоказатьРеквизитыАбонентскогоДоговора();
	//}}
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
&НаСервере
Процедура ПоказатьРеквизитыАбонентскогоДоговора() 
	//{{ВКМ_ отобразить/скрыть реквизитов абонентского договора
	Если ЗначениеЗаполнено(Объект.ВидДоговора) и Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбоненскоеОбслуживание Тогда
		Элементы.ВКМ_ГруппаАбонент.Видимость = Истина;
	иначе
		Элементы.ВКМ_ГруппаАбонент.Видимость = Ложь;
	КонецЕсли;
	//}}
КонецПроцедуры 

#КонецОбласти

