#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	//Добавьте обработку Календарь специалистов, которая будет отображать документы
	//Обслуживание клиентов в календаре в разрезе специалистов
	//НачалоПриода = НачалоНедели(ТекущаяДатаСеанса());
	//КонецПериода = КонецНедели(ТекущаяДатаСеанса()); 

	//НачалоПриода = НачалоМесяца(ДобавитьМесяц(НачалоДня(ТекущаяДатаСеанса()),-1));
	//КонецПериода = КонецМесяца(ДобавитьМесяц(КонецДня (ТекущаяДатаСеанса()),+1)); 

	НачалоПриода = НачалоНедели(ТекущаяДатаСеанса());         
	КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
	//НачалоПриода = ТекущаяДатаСеанса()-7*24*60*60;
	//КонецПериода = ТекущаяДатаСеанса()+21*24*60*60; 

	Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоПриода,КонецПериода); 
	

	ОбновитьПланировщик();
	

КонецПроцедуры   

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Документ_ОбслуживаниеКлиента_Записан" Тогда
		ОбновитьПланировщик();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти   

#Область ОбработчикиСобытийЭлементовШапкиФормы   

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначенияЗаполнения = Новый Структура;
	
	ЗначенияЗаполнения.Вставить("Дата", Начало);
	ЗначенияЗаполнения.Вставить("ДатаПроведенияРабот", Начало); 
	ЗначенияЗаполнения.Вставить("ВремяНачалаРаботПлан", Начало);
	ЗначенияЗаполнения.Вставить("ВремяОкончанияРаботПлан", Конец); 
	Специалист = ЗначенияИзмерений.Получить("Специалисты");
	ЗначенияЗаполнения.Вставить("Специалист",Специалист);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);  
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.ФормаОбъекта",ПараметрыФормы);

КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиКомандФормы  

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьПланировщик();
КонецПроцедуры 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПланировщик()  
	//Добавьте обработку Календарь специалистов, которая будет отображать документы
	//Обслуживание клиентов в календаре в разрезе специалистов
	//НачалоПриода = НачалоНедели(ТекущаяДатаСеанса());
	//КонецПериода = КонецНедели(ТекущаяДатаСеанса()); 

	//НачалоПриода = НачалоМесяца(ДобавитьМесяц(НачалоДня(ТекущаяДатаСеанса()),-1));
	//КонецПериода = КонецМесяца(ДобавитьМесяц(КонецДня (ТекущаяДатаСеанса()),+1)); 

	НачалоПриода = НачалоНедели(ТекущаяДатаСеанса());
	КонецПериода = КонецМесяца(ТекущаяДатаСеанса()); 

	
	Планировщик.Элементы.Очистить();

	ИзмеренияПланировщика = Планировщик.Измерения;
	ИзмеренияПланировщика.Очистить(); 
	
 	ИзмерениеСпециалисты = ИзмеренияПланировщика.Добавить("Специалисты");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГруппыДоступаПользователи.Пользователь КАК Специалист,
	               |	ГруппыДоступаПользователи.Пользователь.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	               |		ПО ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступаРоли.Ссылка
	               |ГДЕ
	               |	ПрофилиГруппДоступаРоли.Роль.Имя В(&Роль1)"
	               ;
				   
	Запрос.УстановитьПараметр("Роль1", "ВКМ_СТО_Специалист"); 
	УстановитьПривилегированныйРежим(Истина);
	ВыборкаСпециалисты = Запрос.Выполнить().Выбрать();
	//ВыборкаСпециалистыТЗ = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	Пользователи.Ссылка КАК Специалист,
	//               |	Пользователи.Наименование КАК Наименование
	//               |ИЗ
	//               |	Справочник.Пользователи КАК Пользователи
	//               |ГДЕ
	//               |	Пользователи.Служебный = ЛОЖЬ";
	//ВыборкаСпециалисты = Запрос.Выполнить().Выбрать();
	//ВыборкаСпециалистыТЗ = Запрос.Выполнить().Выгрузить();
	
	Пока ВыборкаСпециалисты.Следующий() Цикл 
	    НовыйСпециалист = ИзмерениеСпециалисты.Элементы.Добавить(ВыборкаСпециалисты.Специалист);
	    НовыйСпециалист.Текст = ВыборкаСпециалисты.Наименование;
	КонецЦикла;

	Обслуживания = Документы.ВКМ_ОбслуживаниеКлиента.Выбрать(НачалоПриода,КонецПериода);
	
	Пока Обслуживания.Следующий() Цикл 
		
		СоответствиеЗначений = Новый Соответствие;
		СоответствиеЗначений.Вставить("Специалисты",   Обслуживания.Специалист);
		
		НачалоОбслуживания = Обслуживания.ДатаПроведенияРабот + (Обслуживания.ВремяНачалаРаботПлан - НачалоДня(Обслуживания.ВремяНачалаРаботПлан));
		КонецОбслуживания = Обслуживания.ДатаПроведенияРабот + (Обслуживания.ВремяОкончанияРаботПлан - НачалоДня(Обслуживания.ВремяОкончанияРаботПлан));

		ЭлементПланировщика = Планировщик.Элементы.Добавить(НачалоОбслуживания, КонецОбслуживания);
		ЭлементПланировщика.ЗначенияИзмерений  = Новый ФиксированноеСоответствие(СоответствиеЗначений);				
		ЭлементПланировщика.Значение = Обслуживания.Ссылка; 
        ЭлементПланировщика.Текст = "Клиент: " + Обслуживания.Клиент; 
	КонецЦикла;
	

КонецПроцедуры   

#КонецОбласти 

