#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ВыполнитьОбработку();
	ОбщегоНазначенияКлиент.СообщитьПользователю("График заполнен!");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьОбработку()
	//Получаем форму как объект
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");   
	
	//вызываем метод объекта 
	ОбработкаОбъект.ЗаполнитьГрафик(ВыборПериода.ДатаНачала, ВыборПериода.ДатаОкончания, ВыходныеДни);
КонецПроцедуры 

#КонецОбласти