
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент) 
	
	ТекущиеДанныеТаблицы=Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	ТекущиеДанныеТаблицы.Длительность = (НачалоДня(ТекущиеДанныеТаблицы.ДатаОкончания)-НачалоДня(ТекущиеДанныеТаблицы.ДатаНачала)) / (60 * 60 * 24)+1;
	ДлительностьВсегоСтруктура = ОтпускаСотрудниковПриИзмененииНаСервере(ТекущиеДанныеТаблицы.Сотрудник);
	
	Для Каждого Элемент из ДлительностьВсегоСтруктура.МассивИндексов Цикл
		Объект.ОтпускаСотрудников[Элемент-1].ДлительностьВсего =  ДлительностьВсегоСтруктура.ДлительностьВсего;
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы   

&НаКлиенте
Процедура АнализГрафика(Команда)
	   
	ТабличнаяЧастьВХ = ПоместитьВоВременноеХранилищеНаСервере();	
	//ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);          
	
	ПараметрыФормы=Новый Структура;
    ПараметрыФормы.Вставить("Год", Объект.Год);
    ПараметрыФормы.Вставить("ТабличнаяЧастьВХ", ТабличнаяЧастьВХ);
	
	//ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);          
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);          
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции   

&НаСервере
Функция ОтпускаСотрудниковПриИзмененииНаСервере(Сотрудник)
	Отбор = Новый Структура;
	Отбор.Вставить("Сотрудник", Сотрудник);
	Массив = Объект.ОтпускаСотрудников.НайтиСтроки(Отбор);    
	ДлительностьВсего = 0; 
	
	МассивИндексов = Новый Массив;
	
	Для Каждого Элемент из Массив Цикл    
		ДлительностьВсего = ДлительностьВсего + Элемент.Длительность;
		МассивИндексов.Добавить(Элемент.НомерСтроки);
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("МассивИндексов", МассивИндексов);
	Результат.Вставить("ДлительностьВсего", ДлительностьВсего);
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()
    Адрес = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(), УникальныйИдентификатор);
	Возврат Адрес; 
КонецФункции

#КонецОбласти
