
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ВерсияДанных="" тогда
		ЗаполнитьТЧВыплаты(КонецДня(ТекущаяДатаСеанса()));	
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ТекстВопроса = "Заполнить документ остатками по реестру взаиморасчетов?";
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВопросаСервер", ЭтотОбъект);
	Кнопки = РежимДиалогаВопрос.ДаНетОтмена;
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(ОповещениеОЗакрытии, ТекстВопроса, Кнопки, );
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВопросаСервер(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ.Значение = КодВозвратаДиалога.Да Тогда 
		ЗаполнитьТЧВыплаты(КонецДня(Объект.Дата));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура  ЗаполнитьТЧВыплаты(Дата)
	Запрос  = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	Запрос.УстановитьПараметр("Период", Дата);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи =  РезультатЗапроса.Выбрать();  
	//ВыборкаДетальныеЗаписиТЗ =  РезультатЗапроса.Выгрузить();
	
	Объект.Выплаты.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Строка = Объект.Выплаты.Добавить();
		Строка.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Строка.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;
	КонецЦикла;
	
КонецПроцедуры    

#КонецОбласти
