#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СформироватьДвижения(); 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	//Замечание 3. В документах расчета заработной платы НДФЛ рассчитывается вместе с начислениями. 
	//Необходимо рассчитывать отдельно с использованием механизма базы регистров расчета.
	СформироватьДвиженияПоФиксированнойПремии();
	СформироватьДвиженияПоНДФЛ();
	РассчитатьНДФЛ();
	Взаиморасчеты();  
КонецПроцедуры 

Процедура СформироватьДвиженияПоФиксированнойПремии()
	Для Каждого Строка Из СписокСотрудников Цикл
		ДвижениеФиксированнаяПремия = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ДвижениеФиксированнаяПремия.ПериодРегистрации = Дата;
		ДвижениеФиксированнаяПремия.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		ДвижениеФиксированнаяПремия.БазовыйПериодНачало = НачалоМесяца(Дата);    
		ДвижениеФиксированнаяПремия.БазовыйПериодКонец = КонецМесяца(Дата);
		ДвижениеФиксированнаяПремия.ПериодДействияНачало = НачалоМесяца(Дата);    
		ДвижениеФиксированнаяПремия.ПериодДействияКонец = КонецМесяца(Дата);  		
		
		ДвижениеФиксированнаяПремия.Сотрудник = Строка.Сотрудник;   
		ДвижениеФиксированнаяПремия.Результат = Строка.СуммаПремии;
	КонецЦикла;
	Движения.ВКМ_ДополнительныеНачисления.Записать();  
КонецПроцедуры


Процедура СформироватьДвиженияПоНДФЛ()
	Для Каждого Строка Из СписокСотрудников Цикл
		ДвижениеНДФЛ = Движения.ВКМ_Удержания.Добавить();
		ДвижениеНДФЛ.ПериодРегистрации = Дата;
		ДвижениеНДФЛ.БазовыйПериодНачало = НачалоМесяца(Дата);    
		ДвижениеНДФЛ.БазовыйПериодКонец = НачалоДня(КонецМесяца(Дата));
		ДвижениеНДФЛ.Сотрудник = Строка.Сотрудник;
		ДвижениеНДФЛ.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ_ФиксПремия;
		ДвижениеНДФЛ.БазаВидРасчета= ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
	КонецЦикла;
	Движения.ВКМ_Удержания.Записать();  
КонецПроцедуры

Процедура РассчитатьНДФЛ()
	//Замечание 7. В документе Начисление расчет НДФЛ выполняется через обращение к физическим таблицам регистра расчета. 
	//Необходимо обращаться к виртуальной таблице база регистра Удержания.
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Регистратор КАК Регистратор,
	               |	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
	               |	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	               |	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
	               |	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.БазаВидРасчета КАК БазаВидРасчета,
	               |	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
	               |	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.БазовыйПериодКонец КАК БазовыйПериодКонец,
	               |	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Результат КАК Результат,
	               |	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза КАК РезультатБаза
	               |ИЗ
	               |	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения, , Регистратор = &Ссылка) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Регистратор,
	               |	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Измерения = новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения); 
		
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи =  РезультатЗапроса.Выбрать();  
	//ВыборкаДетальныеЗаписиТЗ =  РезультатЗапроса.Выгрузить();  
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДвижениеНДФЛ = Движения.ВКМ_Удержания[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		ДвижениеНДФЛ.Результат = Окр(ВыборкаДетальныеЗаписи.РезультатБаза * 13 / 100,2);
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать(, Истина);

КонецПроцедуры

Процедура Взаиморасчеты()   
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	               |ГДЕ
	               |	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ВКМ_Удержания.Сотрудник
	               |ИЗ
	               |	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	               |ГДЕ
	               |	ВКМ_Удержания.Регистратор = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ВыборкаСотрудникиТЗ =  Запрос.Выполнить().Выгрузить(); 

	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_Удержания.Сотрудник КАК Сотрудник,
	               |	СУММА(ВКМ_Удержания.Результат) КАК Удержания
	               |ПОМЕСТИТЬ ВТ_Удержания
	               |ИЗ
	               |	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	               |ГДЕ
	               |	ВКМ_Удержания.Регистратор = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_Удержания.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	               |	СУММА(ВКМ_ДополнительныеНачисления.Результат) КАК Результат
	               |ПОМЕСТИТЬ ВТ_ДопНачисления
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	               |ГДЕ
	               |	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_ДополнительныеНачисления.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВыборкаСотрудники.Сотрудник КАК Сотрудник
	               |ПОМЕСТИТЬ ВТ_Сотрудники
	               |ИЗ
	               |	&ВыборкаСотрудники КАК ВыборкаСотрудники
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Удержания.Сотрудник КАК Сотрудник,
	               |	ЕСТЬNULL(ВТ_Удержания.Удержания, 0) КАК Удержания,
	               |	ЕСТЬNULL(ВТ_ДопНачисления.Результат, 0) КАК ДопНачисления
	               |ИЗ
	               |	ВТ_Сотрудники КАК ВТ_Сотрудники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Удержания КАК ВТ_Удержания
	               |		ПО ВТ_Сотрудники.Сотрудник = ВТ_Удержания.Сотрудник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопНачисления КАК ВТ_ДопНачисления
	               |		ПО ВТ_Сотрудники.Сотрудник = ВТ_ДопНачисления.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВыборкаСотрудники", ВыборкаСотрудникиТЗ);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи =  РезультатЗапроса.Выбрать();  
	//ВыборкаДетальныеЗаписиТЗ =  РезультатЗапроса.Выгрузить();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;   
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Сумма = ВыборкаДетальныеЗаписи.ДопНачисления - ВыборкаДетальныеЗаписи.Удержания;
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
	КонецЦикла;
	//Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

КонецПроцедуры
	

#КонецОбласти

#КонецЕсли

